Revit 2027 API
MEPCurve.ConnectorManager Property
The connector manager of this MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorManager ConnectorManager { get; }
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
member ConnectorManager : ConnectorManager with get
Property Value
ConnectorManager
See Also
Reference
MEPCurve Class
Autodesk.Revit.DB Namespace